In [1]:
import pandas as pd
df=pd.DataFrame({
    'city':["New york","london","Paris","Tokyo","New york","Paris"],
    'price':[200,150,300,250,180,320]
})

In [2]:
df

       city  price
0  New york    200
1    london    150
2     Paris    300
3     Tokyo    250
4  New york    180
5     Paris    320

In [4]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [5]:
mean_price

{'New york': 190.0, 'Paris': 310.0, 'Tokyo': 250.0, 'london': 150.0}

In [7]:
df["city_encoded"]=df["city"].map(mean_price)

In [8]:
df

       city  price  city_encoded
0  New york    200         190.0
1    london    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New york    180         190.0
5     Paris    320         310.0

In [9]:
df[['price','city_encoded']]

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         190.0
5    320         310.0